In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('Profit Prediction.csv')

In [3]:
df.head(15)

    Marketing Spend  Administration  Transport     Area     Profit
0         114523.61       136897.80  471784.10    Dhaka  192261.83
1         162597.70       151377.59  443898.53      Ctg  191792.06
2         153441.51       101145.55  407934.54  Rangpur  191050.39
3         144372.41       118671.85  383199.62    Dhaka  182901.99
4         142107.34        91391.77  366168.42  Rangpur  166187.94
5         131876.90        99814.71  362861.36    Dhaka  156991.12
6         134615.46       147198.87  127716.82      Ctg  156122.51
7         130298.13       145530.06  323876.68  Rangpur  155752.60
8         120542.52       148718.95  311613.29    Dhaka  152211.77
9         123334.88       108679.17  304981.62      Ctg  149759.96
10        101913.08       110594.11  229160.95  Rangpur  146121.95
11        100671.96        91790.61  249744.55      Ctg  144259.40
12         93863.75       127320.38  249839.44  Rangpur  141585.52
13         91992.39       135495.07  252664.93      Ctg  134307.35
14        119943.24       156547.42  256512.92  Rangpur  132602.65

In [4]:
df.shape

(50, 5)

In [5]:
df.describe()

       Marketing Spend  Administration      Transport         Profit
count        50.000000       50.000000      50.000000      50.000000
mean      73721.615600   121344.639600  211025.097800  112012.639200
std       45902.256482    28017.802755  122290.310726   40306.180338
min           0.000000    51283.140000       0.000000   14681.400000
25%       39936.370000   103730.875000  129300.132500   90138.902500
50%       73051.080000   122699.795000  212716.240000  107978.190000
75%      101602.800000   144842.180000  299469.085000  139765.977500
max      165349.200000   182645.560000  471784.100000  192261.830000

In [6]:
#df.value_counts()

In [7]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

# One Hot Encoding

# Method 1 = pd.get_dummies(_)

In [8]:
areadummies=pd.get_dummies(df['Area'])

In [9]:
areadummies.head()

   Ctg  Dhaka  Rangpur
0    0      1        0
1    1      0        0
2    0      0        1
3    0      1        0
4    0      0        1

Merging two table with using pd.concat( )

In [10]:
df2=pd.concat([df,areadummies],axis=1)

In [11]:
df2.head(10)

,Marketing Spend,Administration,Transport,Area,Profit,Ctg,Dhaka,Rangpur
0,114523.61,136897.80,471784.10,Dhaka,192261.83,0,1,0
1,162597.70,151377.59,443898.53,Ctg,191792.06,1,0,0
2,153441.51,101145.55,407934.54,Rangpur,191050.39,0,0,1
3,144372.41,118671.85,383199.62,Dhaka,182901.99,0,1,0
4,142107.34,91391.77,366168.42,Rangpur,166187.94,0,0,1
5,131876.90,99814.71,362861.36,Dhaka,156991.12,0,1,0
6,134615.46,147198.87,127716.82,Ctg,156122.51,1,0,0
7,130298.13,145530.06,323876.68,Rangpur,155752.60,0,0,1
8,120542.52,148718.95,311613.29,Dhaka,152211.77,0,1,0
9,123334.88,108679.17,304981.62,Ctg,149759.96,1,0,0

In [12]:
x=df2.drop(['Area','Profit'],axis=1)

In [13]:
x.head(5)

   Marketing Spend  Administration  Transport  Ctg  Dhaka  Rangpur
0        114523.61       136897.80  471784.10    0      1        0
1        162597.70       151377.59  443898.53    1      0        0
2        153441.51       101145.55  407934.54    0      0        1
3        144372.41       118671.85  383199.62    0      1        0
4        142107.34        91391.77  366168.42    0      0        1

In [14]:
y=df['Profit']

In [15]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

In [16]:
from sklearn.model_selection import train_test_split

In [17]:
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size=.2,random_state=1)

In [18]:
from sklearn.linear_model import LinearRegression

In [19]:
model1= LinearRegression()

In [20]:
model1.fit(xtrain,ytrain)

LinearRegression()

In [21]:
model1.score(xtest,ytest)

0.9327191723742496

# Method 2 = CountVectorizer()

In [22]:
from sklearn.feature_extraction.text import CountVectorizer

In [23]:
cv= CountVectorizer()
x=cv.fit_transform(df.Area)

In [24]:
cv.get_feature_names()

['ctg', 'dhaka', 'rangpur']

In [25]:
x.toarray()

array([[0, 1, 0],
       [1, 0, 0],
       [0, 0, 1],
       [0, 1, 0],
       [0, 0, 1],
       [0, 1, 0],
       [1, 0, 0],
       [0, 0, 1],
       [0, 1, 0],
       [1, 0, 0],
       [0, 0, 1],
       [1, 0, 0],
       [0, 0, 1],
       [1, 0, 0],
       [0, 0, 1],
       [0, 1, 0],
       [1, 0, 0],
       [0, 1, 0],
       [0, 0, 1],
       [0, 1, 0],
       [1, 0, 0],
       [0, 1, 0],
       [0, 0, 1],
       [0, 0, 1],
       [0, 1, 0],
       [1, 0, 0],
       [0, 0, 1],
       [0, 1, 0],
       [0, 0, 1],
       [0, 1, 0],
       [0, 0, 1],
       [0, 1, 0],
       [1, 0, 0],
       [0, 0, 1],
       [1, 0, 0],
       [0, 1, 0],
       [0, 0, 1],
       [1, 0, 0],
       [0, 1, 0],
       [1, 0, 0],
       [1, 0, 0],
       [0, 0, 1],
       [1, 0, 0],
       [0, 1, 0],
       [1, 0, 0],
       [0, 1, 0],
       [0, 0, 1],
       [1, 0, 0],
       [0, 1, 0],
       [1, 0, 0]], dtype=int64)

Transforming ARRAY into DATA_FRAME

In [26]:
array_df=pd.DataFrame(x.toarray())
array_df.head()

   0  1  2
0  0  1  0
1  1  0  0
2  0  0  1
3  0  1  0
4  0  0  1

Merging two table with using pd.merge( )

In [27]:
df3=pd.merge(df,array_df,right_index=True,left_index=True)
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit  0  1  2
0        114523.61       136897.80  471784.10    Dhaka  192261.83  0  1  0
1        162597.70       151377.59  443898.53      Ctg  191792.06  1  0  0
2        153441.51       101145.55  407934.54  Rangpur  191050.39  0  0  1
3        144372.41       118671.85  383199.62    Dhaka  182901.99  0  1  0
4        142107.34        91391.77  366168.42  Rangpur  166187.94  0  0  1

In [28]:
x1=df3.drop(['Area','Profit'],axis=1)

In [29]:
y1=df3['Profit']

In [30]:
x1.head()

   Marketing Spend  Administration  Transport  0  1  2
0        114523.61       136897.80  471784.10  0  1  0
1        162597.70       151377.59  443898.53  1  0  0
2        153441.51       101145.55  407934.54  0  0  1
3        144372.41       118671.85  383199.62  0  1  0
4        142107.34        91391.77  366168.42  0  0  1

In [31]:
xtrain1,xtest1,ytrain1,ytest1=train_test_split(x1,y1,test_size=.2,random_state=1)

In [32]:
model2= LinearRegression()

In [33]:
model2.fit(xtrain1,ytrain1)

LinearRegression()

In [34]:
model2.score(xtest1,ytest1)

0.9327191723742496